// -------------------------------------------------------------------------------
// 
// 		ＤＸライブラリ		Windows用標準関数の互換関数プログラムヘッダファイル
// 
// 				Ver 3.14d
// 
// -------------------------------------------------------------------------------

#ifndef __DXBASEFUNCWIN_H__
#define __DXBASEFUNCWIN_H__

// インクルード ------------------------------------------------------------------
#include "../DxCompileConfig.h"
#include "../DxBaseFunc.h"

#ifdef DX_USE_NAMESPACE

namespace DxLib
{

#endif // DX_USE_NAMESPACE

// マクロ定義 --------------------------------------------------------------------

#define WIN32_WCHAR_CODEPAGE		(DX_CODEPAGE_UTF16LE)

// 構造体定義 --------------------------------------------------------------------

// テーブル-----------------------------------------------------------------------

// 内部大域変数宣言 --------------------------------------------------------------

// 関数プロトタイプ宣言-----------------------------------------------------------


#ifdef DX_USE_NAMESPACE

}

#endif // DX_USE_NAMESPACE

#endif // __DXBASEFUNCWIN_H__
